Core/src/src/Documents/РасспределениеЗатратНаТовары/РасспределениеЗатратНаТовары.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РасспределениеЗатратНаТовары</name>
  <registerRecords>AccountingRegister.AzRyХозрасчетныйUSD</registerRecords>
  <registerRecords>InformationRegister.ПараметрыВнеоборотныхАктивов</registerRecords>
  <registerRecords>AccumulationRegister.Запасы</registerRecords>
  <registerRecords>AccountingRegister.Хозрасчетный</registerRecords>
  <registerRecords>AccumulationRegister.ДоходыИРасходы</registerRecords>
  <registerRecords>AccumulationRegister.ВнеоборотныеАктивы</registerRecords>
  <attributes>
    <name>ВидОперации</name>
    <type>
      <types>EnumRef.ВидыОперацийРасспределениеЗатратНаТовары</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>ВнеоборотныйАктив</name>
    <type>
      <types>CatalogRef.ВнеоборотныеАктивы</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбъемПродукцииРаботДляВычисленияАмортизацииТек</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СрокИспользованияДляВычисленияАмортизацииТек</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СчетЗатратТек</name>
    <type>
      <types>ChartOfAccountsRef.Управленческий</types>
    </type>
  </attributes>
  <attributes>
    <name>СтруктурнаяЕдиницаТек</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетЗатратРеглТек</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </attributes>
  <attributes>
    <name>СтоимостьДляВычисленияАмортизацииТек</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбъемПродукцииРаботДляВычисленияАмортизацииНов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СрокИспользованияДляВычисленияАмортизацииНов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СчетЗатратНов</name>
    <type>
      <types>ChartOfAccountsRef.Управленческий</types>
    </type>
  </attributes>
  <attributes>
    <name>СтруктурнаяЕдиницаНов</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетЗатратРеглНов</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </attributes>
  <attributes>
    <name>СтоимостьДляВычисленияАмортизацииНов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СчетПереоценкиНов</name>
    <type>
      <types>ChartOfAccountsRef.Управленческий</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетПереоценкиРеглНов</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </attributes>
  <attributes>
    <name>НачислятьАмортизациюВТекущемМесяцеНов</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НаправлениеДеятельностиТек</name>
    <type>
      <types>CatalogRef.НаправленияДеятельности</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресТек</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресНовый</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ГодовойПроцентАмортизацииДляУменьшенногоОстаткаТек</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЛиквидационнаяСтоимостьДляУменьшенногоОстаткаТек</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ГодовойПроцентАмортизацииДляУменьшенногоОстаткаНов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЛиквидационнаяСтоимостьДляУменьшенногоОстаткаНов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ОстаткиПоСчетам</name>
    <attributes>
      <name>СчетУчета</name>
      <type>
        <types>ChartOfAccountsRef.Хозрасчетный</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтруктурнаяЕдиница</name>
      <type>
        <types>CatalogRef.СтруктурныеЕдиницы</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидСубконто1</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ВидыСубконтоХозрасчетные</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидСубконто2</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ВидыСубконтоХозрасчетные</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидСубконто3</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ВидыСубконтоХозрасчетные</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаКотроль</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Проект</name>
      <type>
        <types>CatalogRef.Проекты</types>
      </type>
    </attributes>
    <attributes>
      <name>Партия</name>
      <type>
        <types>CatalogRef.ПартииНоменклатуры</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ОстаткиТоваровНаСкладе</name>
    <attributes>
      <name>Отметка</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>СтруктурнаяЕдиница</name>
      <type>
        <types>CatalogRef.СтруктурныеЕдиницы</types>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаРасходов</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Себистоимость</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Проект</name>
      <type>
        <types>CatalogRef.Проекты</types>
      </type>
    </attributes>
    <attributes>
      <name>Партия</name>
      <type>
        <types>CatalogRef.ПартииНоменклатуры</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Core/src/src/Enums/ВидыОперацийРасспределениеЗатратНаТовары/ВидыОперацийРасспределениеЗатратНаТовары.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыОперацийРасспределениеЗатратНаТовары</name>
  <enumValues>
    <name>НаТовары</name>
  </enumValues>
  <enumValues>
    <name>НаИмущество</name>
  </enumValues>
  <enumValues>
    <name>ПоПроектам</name>
  </enumValues>
</mdclass:Enum>

Core/src/src/Documents/РасспределениеЗатратНаТовары/ObjectModule.bsl
Перем ИспользоватьТолькоРегламентированныйПланСчетов Экспорт; //+++ Дмгг

#Область ПрограммныйИнтерфейс

// Процедура выполняет распределение затрат по количеству.
//
Процедура РаспределитьСуммуСчетовНаТоварыПоКоличеству() Экспорт
	
	ИсхСумма = 0;
	
	//ПодольскийАИ #УчетПроектов 24.12.2020 {
	Если ВидОперации = Перечисления.ВидыОперацийРасспределениеЗатратНаТовары.ПоПроектам Тогда
		
		тзОстаткиПоСчетам = ОстаткиПоСчетам.Выгрузить();
		тзОстаткиПоСчетам.Свернуть("Проект", "Сумма");
		
		Для Каждого СтрокаСчет Из тзОстаткиПоСчетам Цикл
			
			ИсхСумма = 0;
			
			ОтборПоПроекту = Новый Структура("Отметка,Проект", Истина, СтрокаСчет.Проект);
			тзВыбранныеСтроки = ОстаткиТоваровНаСкладе.Выгрузить(ОтборПоПроекту);
		
			БазаРаспределенияКоличество = тзВыбранныеСтроки.Итог("Количество");
			ВсегоРасходы = СтрокаСчет.Сумма;// - Расходы.Итог("СуммаНДС");
			НОД = УправлениеНебольшойФирмойСервер.ПолучитьНОДДляМассива(тзВыбранныеСтроки.ВыгрузитьКолонку("Количество"), 1000);
			
			Если НОД = 0 Тогда
				Возврат;
			КонецЕсли;
			
			СтрокиПоОтбору = ОстаткиТоваровНаСкладе.НайтиСтроки(ОтборПоПроекту);
			Для каждого СтрокаТовары Из СтрокиПоОтбору Цикл
				
				Если СтрокаТовары.Отметка Тогда
					
					Коэффициент = СтрокаТовары.Количество / НОД * 1000;
					СтрокаТовары.СуммаРасходов = ?(БазаРаспределенияКоличество <> 0, Окр((ВсегоРасходы - ИсхСумма) * СтрокаТовары.Количество / БазаРаспределенияКоличество, 2, 1),0);
					
					БазаРаспределенияКоличество = БазаРаспределенияКоличество - СтрокаТовары.Количество;
					
					ИсхСумма = ИсхСумма + СтрокаТовары.СуммаРасходов;
					
				КонецЕсли;
				
			КонецЦикла;
		
		КонецЦикла;
	Иначе
			
		тзВыбранныеСтроки = ОстаткиТоваровНаСкладе.Выгрузить(Новый Структура("Отметка", Истина));
		
		БазаРаспределенияКоличество = тзВыбранныеСтроки.Итог("Количество");
		ВсегоРасходы = ОстаткиПоСчетам.Итог("Сумма");// - Расходы.Итог("СуммаНДС");
		НОД = УправлениеНебольшойФирмойСервер.ПолучитьНОДДляМассива(тзВыбранныеСтроки.ВыгрузитьКолонку("Количество"), 1000);
		
		Если НОД = 0 Тогда
			Возврат;
		КонецЕсли;
		
		Для каждого СтрокаТовары Из ОстаткиТоваровНаСкладе Цикл
			
			Если СтрокаТовары.Отметка Тогда
				
				Коэффициент = СтрокаТовары.Количество / НОД * 1000;
				СтрокаТовары.СуммаРасходов = ?(БазаРаспределенияКоличество <> 0, Окр((ВсегоРасходы - ИсхСумма) * СтрокаТовары.Количество / БазаРаспределенияКоличество, 2, 1),0);
				
				БазаРаспределенияКоличество = БазаРаспределенияКоличество - СтрокаТовары.Количество;
				
				ИсхСумма = ИсхСумма + СтрокаТовары.СуммаРасходов;
				
			КонецЕсли;
			
		КонецЦикла;
		
	//ПодольскийАИ #УчетПроектов 24.12.2020 {
	КонецЕсли;
	//ПодольскийАИ #УчетПроектов 24.12.2020 }
	
КонецПроцедуры // РаспределитьТабЧастьРасходыПоКоличеству()

// Процедура выполняет распределение затрат по сумме.
//
Процедура РаспределитьСуммуСчетовНаТоварыПоСумме() Экспорт
	
	ИсхСумма = 0;
	
	//ПодольскийАИ #УчетПроектов 24.12.2020 {
	Если ВидОперации = Перечисления.ВидыОперацийРасспределениеЗатратНаТовары.ПоПроектам Тогда
		
		тзОстаткиПоСчетам = ОстаткиПоСчетам.Выгрузить();
		тзОстаткиПоСчетам.Свернуть("Проект", "Сумма");
		
		Для Каждого СтрокаСчет Из тзОстаткиПоСчетам Цикл
			
			ИсхСумма = 0;
			
			ОтборПоПроекту = Новый Структура("Отметка,Проект", Истина, СтрокаСчет.Проект);
			тзВыбранныеСтроки = ОстаткиТоваровНаСкладе.Выгрузить(ОтборПоПроекту);
		
			БазаРаспределенияСумма = тзВыбранныеСтроки.Итог("Себистоимость");
			ВсегоРасходы = СтрокаСчет.Сумма;// - Расходы.Итог("СуммаНДС");
			
			НОД = УправлениеНебольшойФирмойСервер.ПолучитьНОДДляМассива(тзВыбранныеСтроки.ВыгрузитьКолонку("Себистоимость"), 100);
			
			Если НОД = 0 Тогда
				Возврат;
			КонецЕсли;
			
			СтрокиПоОтбору = ОстаткиТоваровНаСкладе.НайтиСтроки(ОтборПоПроекту);
			Для каждого СтрокаТовары Из СтрокиПоОтбору Цикл
				
				Если СтрокаТовары.Отметка Тогда
					
					Коэффициент = СтрокаТовары.Себистоимость / НОД * 100;
					СтрокаТовары.СуммаРасходов = ?(БазаРаспределенияСумма <> 0, Окр((ВсегоРасходы - ИсхСумма) * СтрокаТовары.Себистоимость / БазаРаспределенияСумма, 2, 1), 0);
					
					БазаРаспределенияСумма = БазаРаспределенияСумма - СтрокаТовары.Себистоимость;
					ИсхСумма = ИсхСумма + СтрокаТовары.СуммаРасходов;
					
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЦикла;
		
	Иначе
	//ПодольскийАИ #УчетПроектов 24.12.2020 }
		тзВыбранныеСтроки = ОстаткиТоваровНаСкладе.Выгрузить(Новый Структура("Отметка", Истина));
		
		БазаРаспределенияСумма = тзВыбранныеСтроки.Итог("Себистоимость");
		ВсегоРасходы = ОстаткиПоСчетам.Итог("Сумма");// - Расходы.Итог("СуммаНДС");
		
		НОД = УправлениеНебольшойФирмойСервер.ПолучитьНОДДляМассива(тзВыбранныеСтроки.ВыгрузитьКолонку("Себистоимость"), 100);
		
		Если НОД = 0 Тогда
			Возврат;
		КонецЕсли;
		
		Для каждого СтрокаТовары Из ОстаткиТоваровНаСкладе Цикл
			
			Если СтрокаТовары.Отметка Тогда
				
				Коэффициент = СтрокаТовары.Себистоимость / НОД * 100;
				СтрокаТовары.СуммаРасходов = ?(БазаРаспределенияСумма <> 0, Окр((ВсегоРасходы - ИсхСумма) * СтрокаТовары.Себистоимость / БазаРаспределенияСумма, 2, 1), 0);
				
				БазаРаспределенияСумма = БазаРаспределенияСумма - СтрокаТовары.Себистоимость;
				ИсхСумма = ИсхСумма + СтрокаТовары.СуммаРасходов;
				
			КонецЕсли;
			
		КонецЦикла;
		
	//ПодольскийАИ #УчетПроектов 24.12.2020 {
	КонецЕсли;
	//ПодольскийАИ #УчетПроектов 24.12.2020 }
	
КонецПроцедуры // РаспределитьТабЧастьРасходыПоСумме()

#КонецОбласти

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	СтратегияЗаполнения = Новый Соответствие;
	
	ЗаполнениеОбъектовУНФ.ЗаполнитьДокумент(ЭтотОбъект, ДанныеЗаполнения, СтратегияЗаполнения);
	
КонецПроцедуры

Процедура ЗаполнитьПоОстаткамСчета() Экспорт
	
	ОстаткиПоСчетам.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст =
    "ВЫБРАТЬ
    |	СУММА(ЗапасыОстатки.СуммаОстаток) КАК Сумма,
    |	ЗапасыОстатки.СчетУчетаРегл КАК СчетУчета,
    |	ЗапасыОстатки.СтруктурнаяЕдиница
    |ИЗ
    |	РегистрНакопления.Запасы.Остатки(
    |			&ДатаОбработки,
    |			Организация = &Организация
    |				И СтруктурнаяЕдиница = &СтруктурнаяЕдиница
	//|				И Номенклатура = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
    |				И СчетУчета.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.НезавершенноеПроизводство)) КАК ЗапасыОстатки
    |ГДЕ
    |	ЗапасыОстатки.СуммаОстаток > 0  
	|	И ЗапасыОстатки.КоличествоОстаток = 0
    |
    |СГРУППИРОВАТЬ ПО
    |	ЗапасыОстатки.СчетУчетаРегл,
    |	ЗапасыОстатки.СтруктурнаяЕдиница";
	
	Запрос.УстановитьПараметр("ДатаОбработки", КонецДня(Дата));
	Запрос.УстановитьПараметр("Организация", УправлениеНебольшойФирмойСервер.ПолучитьОрганизацию(Организация));
	
	КлючСвязи = 0;
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		НоваяСтрока = ОстаткиПоСчетам.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	// Инициализация дополнительных свойств для проведения документа.
	УправлениеНебольшойФирмойСервер.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства);
	
	// Инициализация данных документа.
	Документы.РасспределениеЗатратНаТовары.ИнициализироватьДанныеДокумента(Ссылка, ДополнительныеСвойства);
	
	// Подготовка наборов записей.
	УправлениеНебольшойФирмойСервер.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
	
	// Отражение в разделах учета.
	УправлениеНебольшойФирмойСервер.ОтразитьЗапасы(ДополнительныеСвойства, Движения, Отказ);
	//УправлениеНебольшойФирмойСервер.ОтразитьДоходыИРасходы(ДополнительныеСвойства, Движения, Отказ);
	УправлениеНебольшойФирмойСервер.ОтразитьВнеоборотныеАктивы(ДополнительныеСвойства, Движения, Отказ);
	УправлениеНебольшойФирмойСервер.ОтразитьПараметрыВнеоборотныхАктивов(ДополнительныеСвойства, Движения, Отказ);
	ИнтеграцияСНалоговойСлужбой_И_БухгалтерскийУчет.ОтразитьХозрасчетный(ДополнительныеСвойства, Движения, Отказ);
	
	// Запись наборов записей
	УправлениеНебольшойФирмойСервер.ЗаписатьНаборыЗаписей(ЭтотОбъект);
	
	ДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц.Закрыть();
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если ВидОперации = Перечисления.ВидыОперацийРасспределениеЗатратНаТовары.НаТовары Тогда 
		
		РазницаСуммТаблиц = ОстаткиПоСчетам.Итог("Сумма") - ОстаткиТоваровНаСкладе.Итог("СуммаРасходов");
		
		Если РазницаСуммТаблиц <> 0 Тогда
			
			ТекстСообщения = НСтр("ka='ხარჯების თანხა არ უდრის მარაგების ცხრილურ ნაწილში გადანაწილებულ თანხას!';ru='Сумма оборотов счетов не равна распределенной сумме в таблице остатков товаров!';en='Accounts speed is not equal to the sum of the distributed amounts are remnants of the goods!'");
			УправлениеНебольшойФирмойСервер.СообщитьОбОшибке(
			,
			ТекстСообщения,
			Неопределено,
			Неопределено,
			Неопределено,
			Отказ
			);
			
		КонецЕсли; 
	
		УправлениеНебольшойФирмойСервер.УдалитьПроверяемыйРеквизит(ПроверяемыеРеквизиты, "ВнеоборотныйАктив");
		УправлениеНебольшойФирмойСервер.УдалитьПроверяемыйРеквизит(ПроверяемыеРеквизиты, "СчетЗатратТек");
		УправлениеНебольшойФирмойСервер.УдалитьПроверяемыйРеквизит(ПроверяемыеРеквизиты, "СтруктурнаяЕдиницаТек");
		УправлениеНебольшойФирмойСервер.УдалитьПроверяемыйРеквизит(ПроверяемыеРеквизиты, "СчетЗатратРеглТек");
		УправлениеНебольшойФирмойСервер.УдалитьПроверяемыйРеквизит(ПроверяемыеРеквизиты, "СчетЗатратНов");
		УправлениеНебольшойФирмойСервер.УдалитьПроверяемыйРеквизит(ПроверяемыеРеквизиты, "СтруктурнаяЕдиницаНов");
		УправлениеНебольшойФирмойСервер.УдалитьПроверяемыйРеквизит(ПроверяемыеРеквизиты, "СчетЗатратРеглНов");
		УправлениеНебольшойФирмойСервер.УдалитьПроверяемыйРеквизит(ПроверяемыеРеквизиты, "СтоимостьДляВычисленияАмортизацииТек");
		УправлениеНебольшойФирмойСервер.УдалитьПроверяемыйРеквизит(ПроверяемыеРеквизиты, "СтоимостьДляВычисленияАмортизацииНов");
		
	ИначеЕсли ВидОперации = Перечисления.ВидыОперацийРасспределениеЗатратНаТовары.НаИмущество Тогда
		
		РазницаСуммТаблиц = ОстаткиПоСчетам.Итог("Сумма") - (СтоимостьДляВычисленияАмортизацииНов - СтоимостьДляВычисленияАмортизацииТек);
		
		Если РазницаСуммТаблиц <> 0 Тогда
			
			ТекстСообщения = НСтр("ka='Сდანახარჯების თანხა არ უდრის ქონებაზე გადასანაწილებელ თანხას!';ru='Сумма оборотов счетов не равна распределенной сумме на имущество!';en='Accounts speed is not equal to the sum of the amount allocated to the property!'");
			УправлениеНебольшойФирмойСервер.СообщитьОбОшибке(
			,
			ТекстСообщения,
			Неопределено,
			Неопределено,
			Неопределено,
			Отказ
			);
			
		КонецЕсли;
		
	//ПодольскийАИ #УчетПроектов 19.12.2020 {
	ИначеЕсли ВидОперации = Перечисления.ВидыОперацийРасспределениеЗатратНаТовары.ПоПроектам Тогда 
		
		РазницаСуммТаблиц = ОстаткиПоСчетам.Итог("Сумма") - ОстаткиТоваровНаСкладе.Итог("СуммаРасходов");
		
		Если РазницаСуммТаблиц <> 0 Тогда
			
			ТекстСообщения = НСтр("ka='ხარჯების თანხა არ უდრის მარაგების ცხრილურ ნაწილში გადანაწილებულ თანხას!';ru='Сумма оборотов счетов не равна распределенной сумме в таблице остатков товаров!';en='Accounts speed is not equal to the sum of the distributed amounts are remnants of the goods!'");
			УправлениеНебольшойФирмойСервер.СообщитьОбОшибке(
			,
			ТекстСообщения,
			Неопределено,
			Неопределено,
			Неопределено,
			Отказ
			);
			
		КонецЕсли; 
	
		УправлениеНебольшойФирмойСервер.УдалитьПроверяемыйРеквизит(ПроверяемыеРеквизиты, "ВнеоборотныйАктив");
		УправлениеНебольшойФирмойСервер.УдалитьПроверяемыйРеквизит(ПроверяемыеРеквизиты, "СчетЗатратТек");
		УправлениеНебольшойФирмойСервер.УдалитьПроверяемыйРеквизит(ПроверяемыеРеквизиты, "СтруктурнаяЕдиницаТек");
		УправлениеНебольшойФирмойСервер.УдалитьПроверяемыйРеквизит(ПроверяемыеРеквизиты, "СчетЗатратРеглТек");
		УправлениеНебольшойФирмойСервер.УдалитьПроверяемыйРеквизит(ПроверяемыеРеквизиты, "СчетЗатратНов");
		УправлениеНебольшойФирмойСервер.УдалитьПроверяемыйРеквизит(ПроверяемыеРеквизиты, "СтруктурнаяЕдиницаНов");
		УправлениеНебольшойФирмойСервер.УдалитьПроверяемыйРеквизит(ПроверяемыеРеквизиты, "СчетЗатратРеглНов");
		УправлениеНебольшойФирмойСервер.УдалитьПроверяемыйРеквизит(ПроверяемыеРеквизиты, "СтоимостьДляВычисленияАмортизацииТек");
		УправлениеНебольшойФирмойСервер.УдалитьПроверяемыйРеквизит(ПроверяемыеРеквизиты, "СтоимостьДляВычисленияАмортизацииНов");
	//ПодольскийАИ #УчетПроектов 19.12.2020 }
	
	КонецЕсли;
	
	Если ОстаткиПоСчетам.Итог("Сумма") = 0 Тогда 
			
		    ТекстСообщения = НСтр("ka='ხარჯის ანგარიში არარის შევსებული გადასანაწილებელი თანხა!';ru='В докумменте отсутствуют суммы распределения!';en='In dokummente no amount of distribution!'");
			УправлениеНебольшойФирмойСервер.СообщитьОбОшибке(
			,
			ТекстСообщения,
			Неопределено,
			Неопределено,
			Неопределено,
			Отказ
			);
			
	КонецЕсли;
		
	//+++ Дмгг
	ИспользоватьТолькоРегламентированныйПланСчетов = ИнтеграцияСНалоговойСлужбой_И_БухгалтерскийУчет.ИспользованиеТолькоРегламентированногоПланаСчетов(Дата);
	Если ИспользоватьТолькоРегламентированныйПланСчетов Тогда 
		УправлениеНебольшойФирмойСервер.УдалитьПроверяемыйРеквизит(ПроверяемыеРеквизиты, "СчетЗатратТек");
		УправлениеНебольшойФирмойСервер.УдалитьПроверяемыйРеквизит(ПроверяемыеРеквизиты, "СчетЗатратНов");
		УправлениеНебольшойФирмойСервер.УдалитьПроверяемыйРеквизит(ПроверяемыеРеквизиты, "СчетПереоценкиНов");
	Иначе
		УправлениеНебольшойФирмойСервер.УдалитьПроверяемыйРеквизит(ПроверяемыеРеквизиты, "СчетЗатратТекРегл");
		УправлениеНебольшойФирмойСервер.УдалитьПроверяемыйРеквизит(ПроверяемыеРеквизиты, "СчетЗатратНовРегл");
		УправлениеНебольшойФирмойСервер.УдалитьПроверяемыйРеквизит(ПроверяемыеРеквизиты, "СчетПереоценкиНовРегл");
	КонецЕсли;
	//--- Дмгг
	
КонецПроцедуры

ИспользоватьТолькоРегламентированныйПланСчетов = ИнтеграцияСНалоговойСлужбой_И_БухгалтерскийУчет.ИспользованиеТолькоРегламентированногоПланаСчетов(?(ЗначениеЗаполнено(Дата),Дата,ТекущаяДата()));//+++ Дмгг
